Repository: bStrano/stralom-keychain-frontend
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Share secret
pt: Compartilhar segredo

# shareableSecretSubmit
source: Share secret
pt: Compartilhar segredo

# shareableSecretInputPlaceholder
source: Enter your secret here
pt: Digite seu segredo aqui!

# shareableSecretPassword
source: Enter the password which will be required to visualize your secret
pt: Digite a senha que sera necessária para visualizar o seu segredo

# shareSecretDescription
source: Keep sensitive information out of your unsecure channels. Share a secret link that is available for a limited time.
pt: Mantenha informações sensíveis longe de canais inseguros. Compartilha um link secreto que só estará disponível por tempo limitado.

# shareableSecretLifetimeInputPlaceholder
source: Define the lifetime of the secret
pt: Defina o tempo de vida do segredo

# shareableSecretRegisterLoadingMessage
source: Your shareable link is being generated!
pt: Seu link de compartilhamento está sendo gerado!

# shareableSecretFeedbackTitle
source: Your shareable link is ready!
pt: Seu segredo compartilhável está pronto!

# shareableSecretFeedbackLifetime
source: Your secret will be available for {viewCount} or until {lifeTime}
pt: Seu segredo ficara disponível por {viewCount} ou até {lifeTime}

# shareableSecretFeedbackSendMail
source: {emoji} Send the link by email
pt: {emoji} Enviar esse link por email

# shareableSecretFeedbackCreateAnother
source: {emoji} Create another secret
pt: {emoji} Criar outro segredo

# shareableSecretFeedbackPasswordTitle
source: Password (Necessary to decrypt your secret)
pt: Senha (Necessária para descriptografar o segredo)

# shareableSecretDetailsTitle
source: Secret available!
pt: Segredo disponível!

# shareableSecretDetailsSubtitle
source: Be aware! The following secret can only be revealed {viewCount} time(s)
pt: Cuidado! O seguinte segredo só pode ser revelado {viewCount} vez(s)

# shareableSecretDetailsRevealButton
source: Reveal secret
pt: Revelar segredo

# shareableSecretDetailsCreateAnotherButton
source: Create another secret
pt: Criar outro segredo

# shareableSecretDetailsNotFoundTitle
source: Oops! Secret not found.
pt: Oops! Segredo não encontrado.

# shareableSecretDetailsNotFoundSubtitle
source: Either it never existed, or it has already expired.
pt: O segredo nunca existiu, ou já expirou.

# vaultSecretRegisterTitle
source: Register a new secret
pt: Cadastre um novo segredo

# loginUsernameInputPlaceholder
source: Email Address
pt: Email

# loginPasswordInputPlaceholder
source: Password
pt: Senha

# loginButtonSubmit
source: Sign In
pt: Entrar

# loginButtonForgotPassword
source: Forgot your password?
pt: Esqueceu sua senha?

# loginButtonRegister
source: Register
pt: Cadastrar

# nDays
source: {count, plural, =0{ days} =1{1 day} other{{count} days}}
pt: {count, plural, =0{ dias} =1{1 dia} other{{count} dias}}

# nMonths
source: {count, plural, =0{ months} =1{1 month} other{{count} months}}
pt: {count, plural, =0{ meses} =1{1 mês} other{{count} meses}}

# nWeeks
source: {count, plural, =0{ weeks} =1{1 week} other{{count} weeks}}
pt: {count, plural, =0{ semanas} =1{1 semana} other{{count} semanas}}

# nYears
source: {count, plural, =0{ years} =1{1 year} other{{count} years}}
pt: {count, plural, =0{ anos} =1{1 ano} other{{count} anos}}

# nVisualizations
source: {count, plural, =0{ visualizations} =1{1 visualization} other{{count} visualizations}}
pt: {count, plural, =0{ visualizações} =1{1 visualização} other{{count} visualizações}}

# copyClipboard
source: Copied to your clipboard!
pt: Copiado para a área de transferência!

source: Shareable Secret
pt: Segredo compartilhável

source: Username
pt: Usuário

source: Password
pt: Senha

source: Encryption Password
pt: Chave de encriptação

source: Title
pt: Titulo

source: Subtitle
pt: Subtitulo

source: Cancel
pt: Cancelar

source: Save
pt: Salvar

# validatorNotEmpty
source: This field is required
pt: Esse campo é obrigatório

# validatorMinLength
source: This field must be at least {min} characters long
pt: Esse campo necessita possuir pelo menos {min} caracteres

source: or
pt: ou

# additionalInfo
source: Additional information
pt: Informações adicionais
